# Файл, описывающий сборку проекта (обеспечивает раздельную компиляцию модулей)
# Для сборки проекта наберите $ make
# Для удаления всех собранных файлов наберите $ make clean
# Для полной пересборки проекта наберите $ make -B

# Параметры проекта

# Компилятор
CC = gcc
# Флаги для компиляции объектных файлов модулей
CFLAGS = -std=c89 -Wall -c
# Флаги для компоновки исполняемого файла
LDFLAGS = -Wall
# Объектные файлы модулей, необходимые для компоновки исполняемого файла
OBJECTS = stack.o main.o
# Имя исполняемого файла
EXECUTABLE = stack

# Правила для сборки проекта

# Главная задача: компоновка исполняемого файла из объектных файлов модулей
$(EXECUTABLE): $(OBJECTS)
	$(CC) $(LDFLAGS) -o $@ $^
# Компиляция модулей в объектные файлы
%.o: %.c stack.h
	$(CC) $(CFLAGS) $<
# Удаление всех бинарных файлов
.PHONY: clean
clean:
	$(RM) $(EXECUTABLE) $(OBJECTS)
